run/acousticTests/TimeDomainTests/Andrade2019/wedgeHexTwoWayCoupWindow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0 0 -0.1)//0
    (19 0 -0.1)//1
    (19 7.64 -0.1)//2
    (0 7.64 -0.1)//3
    (0 0 0.1)//4
    (19 0 0.1)//5
    (19 7.64 0.1)//6
    (0 7.64 0.1)//7
    (39 0 -0.1)//8
    (39 7.64 -0.1)//9
    (39 0 0.1)//10
    (39 7.64 0.1)//11

    (58 0 -0.1)//12
    (58 7.64 -0.1)//13
    (58 0 0.1)//14
    (58 7.64 0.1)//15
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (190 220 1) simpleGrading (1 1 1)
    hex (1 8 9 2 5 10 11 6) (200 220 1) simpleGrading (1 1 1)
    hex (8 12 13 9 10 14 15 11) (190 220 1) simpleGrading (1 1 1)
);

boundary
(
    walls
    {
        type wall;
        faces
        (

            (0 4 7 3)
            (12 13 15 14)
           
        );
    }
    inlet_w1
    {
        type wall;
        faces
        (
            (3 2 6 7)


        );
    }

    acous
    {
        type wall;
        faces
        (

            (2 9 11 6)

        );
    }

    inlet_w2
    {
        type wall;
        faces
        (

            (9 13 15 11)

        );
    }
    outlet
    {
        type wall;
        faces
        (
            (0 1 5 4)
	    (1 8 10 5)
	    (8 12 14 10)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
	    (1 2 9 8)
	    (8 9 13 12)
            (4 7 6 5)
	    (5 6 11 10)
	    (10 11 15 14)
        );
    }
);

// ************************************************************************* //
