run/acousticTests/TimeDomainTests/Andrade2019/wedgeHexTwoWayCoupWindow/constant/levitatorWedgeHex.geo_unrolled
cl__1 = 1;
Point(14) = {0, 0, 0, cl__1};
Point(15) = {0.009998476951563914, 0, 0.0001745240643728351, cl__1};
Point(16) = {0.009998476951563914, 0.00744, 0.0001745240643728351, cl__1};
Point(17) = {0, 0.00744, 0, cl__1};
Point(18) = {0.01899710620797143, 0, 0.0003315957223083867, cl__1};
Point(19) = {0.01899710620797143, 0.00744, 0.0003315957223083867, cl__1};
Point(20) = {0.01899710620797143, -0.01, 0.0003315957223083867, cl__1};
Point(21) = {0.02899558315953535, -0.01, 0.0005061197866812218, cl__1};
Point(22) = {0.02899558315953535, 0, 0.0005061197866812218, cl__1};
Point(23) = {0.02899558315953535, 0.00744, 0.0005061197866812218, cl__1};
Point(24) = {0.02899558315953535, 0.01744, 0.0005061197866812218, cl__1};
Point(25) = {0.01899710620797143, 0.01744, 0.0003315957223083867, cl__1};
Point(26) = {0.009998476951563914, 0.01744, 0.0001745240643728351, cl__1};
Point(27) = {0.009998476951563914, 0, -0.0001745240643728351, cl__1};
Point(28) = {0.009998476951563914, 0.00744, -0.0001745240643728351, cl__1};
Point(29) = {0.01899710620797143, 0, -0.0003315957223083867, cl__1};
Point(30) = {0.01899710620797143, 0.00744, -0.0003315957223083867, cl__1};
Point(31) = {0.01899710620797143, -0.01, -0.0003315957223083867, cl__1};
Point(32) = {0.02899558315953535, -0.01, -0.0005061197866812218, cl__1};
Point(33) = {0.02899558315953535, 0, -0.0005061197866812218, cl__1};
Point(34) = {0.02899558315953535, 0.00744, -0.0005061197866812218, cl__1};
Point(35) = {0.02899558315953535, 0.01744, -0.0005061197866812218, cl__1};
Point(36) = {0.01899710620797143, 0.01744, -0.0003315957223083867, cl__1};
Point(37) = {0.009998476951563914, 0.01744, -0.0001745240643728351, cl__1};
Line(19) = {14, 15};
Transfinite Curve {19} = 294 Using Progression 1;
Line(20) = {15, 16};
Transfinite Curve {20} = 219 Using Progression 1;
Line(21) = {16, 17};
Transfinite Curve {21} = 294 Using Progression 1;
Line(22) = {17, 14};
Transfinite Curve {22} = 219 Using Progression 1;
Line(23) = {15, 18};
Transfinite Curve {23} = 265 Using Progression 1;
Line(24) = {18, 19};
Transfinite Curve {24} = 219 Using Progression 1;
Line(25) = {19, 16};
Transfinite Curve {25} = 265 Using Progression 1;
Line(26) = {18, 20};
Transfinite Curve {26} = 294 Using Progression 1;
Line(27) = {20, 21};
Transfinite Curve {27} = 294 Using Progression 1;
Line(28) = {21, 22};
Transfinite Curve {28} = 294 Using Progression 1;
Line(29) = {22, 18};
Transfinite Curve {29} = 294 Using Progression 1;
Line(30) = {22, 23};
Transfinite Curve {30} = 219 Using Progression 1;
Line(31) = {19, 23};
Transfinite Curve {31} = 294 Using Progression 1;
Line(32) = {23, 24};
Transfinite Curve {32} = 294 Using Progression 1;
Line(33) = {24, 25};
Transfinite Curve {33} = 294 Using Progression 1;
Line(34) = {19, 25};
Transfinite Curve {34} = 294 Using Progression 1;
Line(35) = {25, 26};
Transfinite Curve {35} = 265 Using Progression 1;
Line(36) = {26, 16};
Transfinite Curve {36} = 294 Using Progression 1;
p37 = newp;
Point(p37 + 1) = {0, 0, 0};
Circle(37) = {15, p37 + 1, 27};
Line(38) = {14, 27};
p39 = newp;
Point(p39 + 1) = {0, 0.00744, 0};
Circle(39) = {16, p39 + 1, 28};
Line(40) = {27, 28};
Line(41) = {28, 17};
p42 = newp;
Point(p42 + 1) = {0, 0, 0};
Circle(42) = {18, p42 + 1, 29};
Line(43) = {27, 29};
p44 = newp;
Point(p44 + 1) = {0, 0.00744, 0};
Circle(44) = {19, p44 + 1, 30};
Line(45) = {29, 30};
Line(46) = {30, 28};
p47 = newp;
Point(p47 + 1) = {0, -0.01, 0};
Circle(47) = {20, p47 + 1, 31};
Line(48) = {29, 31};
p49 = newp;
Point(p49 + 1) = {0, -0.01, 0};
Circle(49) = {21, p49 + 1, 32};
Line(50) = {31, 32};
p51 = newp;
Point(p51 + 1) = {0, 0, 0};
Circle(51) = {22, p51 + 1, 33};
Line(52) = {32, 33};
Line(53) = {33, 29};
p54 = newp;
Point(p54 + 1) = {0, 0.00744, 0};
Circle(54) = {23, p54 + 1, 34};
Line(55) = {33, 34};
Line(56) = {30, 34};
p57 = newp;
Point(p57 + 1) = {0, 0.01744, 0};
Circle(57) = {24, p57 + 1, 35};
Line(58) = {34, 35};
p59 = newp;
Point(p59 + 1) = {0, 0.01744, 0};
Circle(59) = {25, p59 + 1, 36};
Line(60) = {35, 36};
Line(61) = {30, 36};
p62 = newp;
Point(p62 + 1) = {0, 0.01744, 0};
Circle(62) = {26, p62 + 1, 37};
Line(63) = {36, 37};
Line(64) = {37, 28};
Curve Loop(20) = {19, 20, 21, 22};
Plane Surface(20) = {20};
Transfinite Surface {20};
Recombine Surface {20};
Curve Loop(22) = {23, 24, 25, -20};
Plane Surface(22) = {22};
Transfinite Surface {22};
Recombine Surface {22};
Curve Loop(24) = {26, 27, 28, 29};
Plane Surface(24) = {24};
Transfinite Surface {24};
Recombine Surface {24};
Curve Loop(26) = {-24, -29, 30, -31};
Plane Surface(26) = {26};
Transfinite Surface {26};
Recombine Surface {26};
Curve Loop(28) = {31, 32, 33, -34};
Plane Surface(28) = {28};
Transfinite Surface {28};
Recombine Surface {28};
Curve Loop(30) = {34, 35, 36, -25};
Plane Surface(30) = {30};
Transfinite Surface {30};
Recombine Surface {30};
Curve Loop(31) = {-37, -19, 38};
Plane Surface(31) = {31};
Curve Loop(32) = {37, 40, -39, -20};
Surface(32) = {32};
Curve Loop(33) = {39, 41, -21};
Plane Surface(33) = {33};
Curve Loop(34) = {38, 40, 41, 22};
Plane Surface(34) = {34};
Curve Loop(35) = {37, 43, -42, -23};
Plane Surface(35) = {35};
Curve Loop(36) = {42, 45, -44, -24};
Surface(36) = {36};
Curve Loop(37) = {44, 46, -39, -25};
Plane Surface(37) = {37};
Curve Loop(38) = {43, 45, 46, -40};
Plane Surface(38) = {38};
Curve Loop(39) = {42, 48, -47, -26};
Surface(39) = {39};
Curve Loop(40) = {47, 50, -49, -27};
Plane Surface(40) = {40};
Curve Loop(41) = {49, 52, -51, -28};
Surface(41) = {41};
Curve Loop(42) = {51, 53, -42, -29};
Plane Surface(42) = {42};
Curve Loop(43) = {48, 50, 52, 53};
Plane Surface(43) = {43};
Curve Loop(44) = {51, 55, -54, -30};
Surface(44) = {44};
Curve Loop(45) = {44, 56, -54, -31};
Plane Surface(45) = {45};
Curve Loop(46) = {-45, -53, 55, -56};
Plane Surface(46) = {46};
Curve Loop(47) = {54, 58, -57, -32};
Surface(47) = {47};
Curve Loop(48) = {57, 60, -59, -33};
Plane Surface(48) = {48};
Curve Loop(49) = {44, 61, -59, -34};
Surface(49) = {49};
Curve Loop(50) = {56, 58, 60, -61};
Plane Surface(50) = {50};
Curve Loop(51) = {59, 63, -62, -35};
Plane Surface(51) = {51};
Curve Loop(52) = {62, 64, -39, -36};
Surface(52) = {52};
Curve Loop(53) = {61, 63, 64, -46};
Plane Surface(53) = {53};
Surface Loop(1) = {31, 32, 33, 20, 34};
Volume(1) = {1};
Surface Loop(2) = {35, 36, 37, 32, 22, 38};
Volume(2) = {2};
Surface Loop(3) = {39, 40, 41, 42, 24, 43};
Volume(3) = {3};
Surface Loop(4) = {36, 42, 44, 45, 26, 46};
Volume(4) = {4};
Surface Loop(5) = {45, 47, 48, 49, 28, 50};
Volume(5) = {5};
Surface Loop(6) = {49, 51, 52, 37, 30, 53};
Volume(6) = {6};
Physical Surface("transducer1") = {33};
Physical Surface("transducer2") = {52};
Physical Surface("openAir") = {40, 41, 44, 47, 48, 51};
Physical Surface("reflector1") = {31, 35};
Physical Surface("reflector2") = {39};
Physical Surface("front") = {20, 22, 24, 26, 28, 30};
Physical Surface("back") = {34, 38, 43, 46, 50, 53};
Physical Volume("internal") = {1, 2, 3, 4, 5, 6};
