run/acousticTests/TimeDomainTests/Andrade2019/wedgeHexTwoWayCoupWindow/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

// NOTE: different boundary conditions as in the original publication
// of Popinet in 2009
boundaryField
{
    "(transducer.*|reflector2|openAir)"
    {
       
 	type            zeroGradient;
    }
    reflector1
    {
        type        fixedValue;
        value       $internalField;
    }

     "(front|back)"
     { 
         type            wedge;
     }

}


// ************************************************************************* //
