run/acousticTests/TimeDomainTests/Andrade2019/wedgeHexTwoWayCoupWindow/0.orig/pa
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0]; // [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
   openAir//"(walls|inlet_w1|inlet_w2)"
    {
        //type            zeroGradient;
        //type            fixedValue;
        //value            uniform 0;
         type            acousticWaveTransmissive;
         advectiveSpeed  343;
         value           $internalField;

    }
/*    inlet_w1
    {
        //type            zeroGradient;
        type            fixedValue;
        value            uniform 0;
    }*/
    transducer1
    {
/*
        type            fixedValue;
        value            uniform 100;
*/
/*          type          soundPressureRadiation;
          advectiveSpeed  343;*/
/*        type           soundHarmonicPressure;//soundPressureSource; //soundPressureRadiation;//zeroGradient;
        frequency       25250;
        amplitude       1.2; // advectiveSpeed  343;*/
//        value           $internalField;
/*          type            uniformFixedValue;
         uniformValue    sine;
         uniformValueCoeffs
         {
             frequency       constant 40000;
             scale           constant 411.6;
             level           constant 0;
         }
         value           $internalField;*/
             type            uniformFixedGradient;
             uniformGradient     cosine;
             uniformGradientCoeffs
          {
              frequency       constant 25250;
              scale           constant #eval{-1.2*2*pi()*25250};//411.6;
              level           constant 0;
          }
          value           $internalField;
    }
/*    inlet_w2
    {
        //type            zeroGradient;
        type            fixedValue;
        value            uniform 0;
    }*/
    "(transducer2|reflector2|reflector1)"
    {
        type            zeroGradient;
     /*   type            fixedValue;
        value            uniform 0;*/
    }
    "(front|back)"
    {
        type            wedge;
    }
}

// ************************************************************************* //
